#! /usr/bin/env python
# -*- coding=utf-8 -*-

import itertools
import numpy as np


#list中4个数分别代表 x,y,z,e的系数,共10组
a_1 = [82.02, 78.16, 14.01, 50.27]
a_2 = [282.90, 236.59, 74.55, 158.63]
a_3 = [339.41, 201.35, 46.28, 146.19]
a_4 = [374.79, 31.52, 62.03, 66.74]
a_5 = [141.90, 157.71, 31.12, 98.67]
a_6 = [361.35, 180.58, 56.72, 139.24]
a_7 = [1603.53, 429.72, 204.73, 428.95]
a_8 = [2075.72, 316.24, 414.48, 445.22]
a_9 = [1482.32, 13.12, 558.68, 229.09]
a_10 = [2227.56, 15.94, 1380.39, 378.44]

#list中4个数分别代表等号右边的值,共10组与a对应
b_1 = 3.70
b_2 = -14.01
b_3 = 37.62
b_4 = -58.18
b_5 = 32.35
b_6 = -60.82
b_7 = -62.63
b_8 = -1.75
b_9 = 37.52
b_10 = 38.28

#方程
f_1 = [a_1, b_1]
f_2 = [a_2, b_2]
f_3 = [a_3, b_3]
f_4 = [a_4, b_4]
f_5 = [a_5, b_5]
f_6 = [a_6, b_6]
f_7 = [a_7, b_7]
f_8 = [a_8, b_8]
f_9 = [a_9, b_9]
f_10 = [a_10, b_10]


def get_result(f_1, f_2, f_3, f_4):
    a = np.array([f_1[0],f_2[0],f_3[0],f_4[0]])
    b = np.array([f_1[1],f_2[1],f_3[1],f_4[1]])
    result = np.linalg.solve(a,b)
    if float(result[0]) > 0:
        print(a,b,result)
    #print(np.dot(a,result))



c = list(itertools.combinations([f_1,f_2,f_3,f_4,f_5,f_6,f_7,f_8,f_9,f_10],4))

#print(len(c))
for array in c:
    get_result(array[0],array[1],array[2],array[3])

